# Вопросы и ответы к викторине
questions = {
    'Какой стиль жизни вам ближе?': {'Активный': 'аctive', 'Спокойный': 'сalm', 'Независымый': 'independent', 'Исследовательский': 'explore'},
    'Какое время суток вы предпочитаете?': {'Утро': 'morning', 'День': 'day', 'Вечер': 'evening', 'Ночь': 'night'},
    'Какое из этих качеств вам наиболее близко?': {'Храбрость': 'brave', 'Интеллект': 'intellect',
                                                   'Независимость': 'independence', 'Уверенность': 'certain'},
    'Как вы предпочитаете проводить свободное время?': {'В кругу друзей или семьи': 'friends', 'На природе': "in nature",
                                                        'Читая книги или размышляя': 'read book',
                                                        'Занимаясь чем-то активным, спортом или хобби': 'hobby'},
    'Как вы относитесь к сложным задачам?': {'Решаю их с умом и терпением': 'solve', 'Нападаю на проблему сразу': 'attack',
                                             'Сначала анализирую, потом действую': 'analyze', 'Доверяю интуиции и действую смело': 'trust'},
    'Какое место вам больше по душе?': {'Лес или горы': 'forest', 'Высокие вершины или открытые пространства': 'peaks',
                                        'Просторная равнина или саванна': 'savanna', 'Джунгли или густые леса': 'jungle'},
    'Как вы представляете идеального лидера?': {'Мудрый и стратегический': 'wise', 'Храбрый и решительный': 'spunky',
                                                'Заботливый и поддерживающий': 'caring', 'Сильный и независимый': 'strong'},
}
answers = {
    'active': 3, 'calm': 4, 'independent': 2, 'explore': 1,
    'morning': 3, 'day': 2, 'evening': 4, 'night': 1,
    'brave': 3, 'intellect': 4, 'independence': 2, 'certain': 1,
    'friends': 1, 'in nature': 3, 'read book': 4, 'hobby': 2,
    'solve': 4, 'attack': 3, 'analyze': 2, 'trust': 1,
    'forest': 1, 'peaks': 3, 'savanna': 4, 'jungle': 2,
    'wise': 4, 'spunky': 3, 'caring': 1, 'strong': 2
}
